vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/components/video/camera/device/ov5640/fsl_ov5640.c
/*
 * Copyright 2017-2018, 2020 NXP
 *
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_video_common.h"
#include "fsl_camera.h"
#include "fsl_camera_device.h"
#include "fsl_ov5640.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define OV5640_DelayMs VIDEO_DelayMs

#define OV5640_SCCB_ADDR            0x3CU
#define OV5640_RESOLUTION_PARAM_NUM 0x16U

#define OV5640_WriteReg(handle, reg, val)                             \
    SCCB_WriteReg(OV5640_SCCB_ADDR, kSCCB_RegAddr16Bit, (reg), (val), \
                  ((ov5640_resource_t *)((handle)->resource))->i2cSendFunc)

#define OV5640_WriteMultiRegs(handle, reg, val, len)                             \
    SCCB_WriteMultiRegs(OV5640_SCCB_ADDR, kSCCB_RegAddr16Bit, (reg), (val), len, \
                        ((ov5640_resource_t *)((handle)->resource))->i2cSendFunc)

#define OV5640_ReadReg(handle, reg, val)                             \
    SCCB_ReadReg(OV5640_SCCB_ADDR, kSCCB_RegAddr16Bit, (reg), (val), \
                 ((ov5640_resource_t *)((handle)->resource))->i2cReceiveFunc)

#define OV5640_ModifyReg(handle, reg, clrMask, val)                               \
    SCCB_ModifyReg(OV5640_SCCB_ADDR, kSCCB_RegAddr16Bit, (reg), (clrMask), (val), \
                   ((ov5640_resource_t *)((handle)->resource))->i2cReceiveFunc,   \
                   ((ov5640_resource_t *)((handle)->resource))->i2cSendFunc)

#define OV5640_POLARITY_CTRL00_VSYNC_MASK           (1U << 0U)
#define OV5640_POLARITY_CTRL00_HREF_MASK            (1U << 1U)
#define OV5640_POLARITY_CTRL00_GATE_PCLK_HREF_MASK  (1U << 2U)
#define OV5640_POLARITY_CTRL00_GATE_PCLK_VSYNC_MASK (1U << 3U)
#define OV5640_POLARITY_CTRL00_PCLK_MASK            (1U << 5U)

#define OV5640_SDE_CTRL0_REG  0x5580
#define OV5640_SDE_CTRL1_REG  0x5581
#define OV5640_SDE_CTRL2_REG  0x5582
#define OV5640_SDE_CTRL3_REG  0x5583
#define OV5640_SDE_CTRL4_REG  0x5584
#define OV5640_SDE_CTRL5_REG  0x5585
#define OV5640_SDE_CTRL6_REG  0x5586
#define OV5640_SDE_CTRL7_REG  0x5587
#define OV5640_SDE_CTRL8_REG  0x5588
#define OV5640_SDE_CTRL9_REG  0x5589
#define OV5640_SDE_CTRL10_REG 0x558a
#define OV5640_SDE_CTRL11_REG 0x558b
#define OV5640_SDE_CTRL12_REG 0x558c

#define OV5640_AWB_R_H_REG  0x3400
#define OV5640_AWB_R_L_REG  0x3401
#define OV5640_AWB_G_H_REG  0x3402
#define OV5640_AWB_G_L_REG  0x3403
#define OV5640_AWB_B_H_REG  0x3404
#define OV5640_AWB_B_L_REG  0x3405
#define OV5640_AWB_CTRL_REG 0x3406

#define OV5640_CHECK_RET(x)            \
    do                                 \
    {                                  \
        status = (x);                  \
        if (kStatus_Success != status) \
        {                              \
            return status;             \
        }                              \
    } while (false)

typedef struct _ov5640_reg_val
{
    uint16_t regAddr; /*!< Register address. */
    uint8_t regVal;   /*!<Register value. */
} ov5640_reg_val_t;

typedef struct _ov5640_resolution_param
{
    uint32_t resolution; /*!< Resolution, see @ref video_resolution_t and @ref FSL_VIDEO_RESOLUTION. */
    uint8_t param[OV5640_RESOLUTION_PARAM_NUM]; /*!< Parameter 0x3800 to 0x3813. */
} ov5640_resolution_param_t;

typedef struct
{
    uint32_t resolution;
    uint8_t framePerSec;
    uint8_t pllCtrl1;
    uint8_t pllCtrl2;
    uint8_t vfifoCtrl0C;
    uint8_t pclkDiv;
    uint8_t pclkPeriod;
} ov5640_clock_config_t;

typedef struct
{
    uint8_t lightMode;
    uint8_t awbCtrl;
    uint8_t awbR_H;
    uint8_t awbR_L;
    uint8_t awbG_H;
    uint8_t awbG_L;
    uint8_t awbB_H;
    uint8_t awbB_L;
} ov5640_light_mode_config_t;

typedef struct
{
    uint8_t effect;
    uint8_t sdeCtrl0;
    uint8_t sdeCtrl3;
    uint8_t sdeCtrl4;
} ov5640_special_effect_config_t;

typedef status_t (*ov5640_cmd_func_t)(camera_device_handle_t *handle, int32_t arg);

typedef struct
{
    camera_device_cmd_t cmd;
    ov5640_cmd_func_t func;
} ov5640_cmd_func_map_t;

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
status_t OV5640_Init(camera_device_handle_t *handle, const camera_config_t *config);

status_t OV5640_Deinit(camera_device_handle_t *handle);

status_t OV5640_Control(camera_device_handle_t *handle, camera_device_cmd_t cmd, int32_t arg);

status_t OV5640_Start(camera_device_handle_t *handle);

status_t OV5640_Stop(camera_device_handle_t *handle);

status_t OV5640_InitExt(camera_device_handle_t *handle, const camera_config_t *config, const void *specialConfig);

status_t OV5640_SetSpecialEffect(camera_device_handle_t *handle, int32_t effect);

status_t OV5640_SetLightMode(camera_device_handle_t *handle, int32_t lightMode);

status_t OV5640_SetSaturation(camera_device_handle_t *handle, int32_t saturation);

status_t OV5640_SetContrast(camera_device_handle_t *handle, int32_t contrast);

status_t OV5640_SetBrightness(camera_device_handle_t *handle, int32_t brightness);

/*******************************************************************************
 * Variables
 ******************************************************************************/
static const ov5640_reg_val_t ov5640InitParam[] = {
    {0x3008, 0x42},

    /* System setting. */
    {0x3103, 0x03},
    {0x3000, 0x00},
    {0x3004, 0xff},
    {0x3002, 0x1c},
    {0x3006, 0xc3},
    {0x302e, 0x08},
    {0x3037, 0x13},
    {0x3108, 0x01},
    {0x3618, 0x00},
    {0x3612, 0x29},
    {0x3708, 0x64},
    {0x3709, 0x52},
    {0x370c, 0x03},
    {0x3820, 0x41},
    {0x3821, 0x07},
    {0x3630, 0x36},
    {0x3631, 0x0e},
    {0x3632, 0xe2},
    {0x3633, 0x12},
    {0x3621, 0xe0},
    {0x3704, 0xa0},
    {0x3703, 0x5a},
    {0x3715, 0x78},
    {0x3717, 0x01},
    {0x370b, 0x60},
    {0x3705, 0x1a},
    {0x3905, 0x02},
    {0x3906, 0x10},
    {0x3901, 0x0a},
    {0x3731, 0x12},
    {0x3600, 0x08},
    {0x3601, 0x33},
    {0x302d, 0x60},
    {0x3620, 0x52},
    {0x371b, 0x20},
    {0x471c, 0x50},
    {0x3a13, 0x43},
    {0x3a18, 0x00},
    {0x3a19, 0x7c},
    {0x3635, 0x13},
    {0x3636, 0x03},
    {0x3634, 0x40},
    {0x3622, 0x01},
    {0x3c01, 0x00},
    {0x3a00, 0x58},
    {0x4001, 0x02},
    {0x4004, 0x02},
    {0x4005, 0x1a},
    {0x5001, 0xa3},

