vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/components/video/camera/device/ov5640/fsl_ov5640.c
/* MIPI */
static const ov5640_clock_config_t s_ov5640MipiClockConfigs[] = {
    {
        .resolution  = (uint32_t)kVIDEO_ResolutionVGA,
        .framePerSec = 15,
        .pllCtrl1    = 0x22,
        .pllCtrl2    = 0x38,
        .vfifoCtrl0C = 0x22,
        .pclkDiv     = 0x02,
        .pclkPeriod  = 0x0a,
    },
    {
        .resolution  = (uint32_t)kVIDEO_ResolutionVGA,
        .framePerSec = 30,
        .pllCtrl1    = 0x14,
        .pllCtrl2    = 0x38,
        .vfifoCtrl0C = 0x22,
        .pclkDiv     = 0x02,
        .pclkPeriod  = 0x0a,
    },
    {
        .resolution  = (uint32_t)kVIDEO_ResolutionQVGA,
        .framePerSec = 15,
        .pllCtrl1    = 0x22,
        .pllCtrl2    = 0x38,
        .vfifoCtrl0C = 0x22,
        .pclkDiv     = 0x02,
        .pclkPeriod  = 0x0a,
    },
    {
        .resolution  = (uint32_t)kVIDEO_ResolutionQVGA,
        .framePerSec = 30,
        .pllCtrl1    = 0x14,
        .pllCtrl2    = 0x38,
        .vfifoCtrl0C = 0x22,
        .pclkDiv     = 0x02,
        .pclkPeriod  = 0x0a,
    },
    {
        .resolution  = (uint32_t)kVIDEO_Resolution720P,
        .framePerSec = 15,
        .pllCtrl1    = 0x41,
        .pllCtrl2    = 0x54,
        .vfifoCtrl0C = 0x20,
        .pclkDiv     = 0x04,
        .pclkPeriod  = 0x0a,
    },
    {
        .resolution  = (uint32_t)kVIDEO_Resolution720P,
        .framePerSec = 30,
        .pllCtrl1    = 0x21,
        .pllCtrl2    = 0x54,
        .vfifoCtrl0C = 0x20,
        .pclkDiv     = 0x04,
        .pclkPeriod  = 0x0a,
    },
    {
        .resolution  = (uint32_t)kVIDEO_Resolution1080P,
        .framePerSec = 15,
        .pllCtrl1    = 0x21,
        .pllCtrl2    = 0x54,
        .vfifoCtrl0C = 0x20,
        .pclkDiv     = 0x04,
        .pclkPeriod  = 0x0a,
    },
    {
        .resolution  = (uint32_t)kVIDEO_Resolution1080P,
        .framePerSec = 30,
        .pllCtrl1    = 0x11,
        .pllCtrl2    = 0x54,
        .vfifoCtrl0C = 0x20,
        .pclkDiv     = 0x04,
        .pclkPeriod  = 0x0a,
    },
};

static const ov5640_light_mode_config_t s_ov5640LightModeConfigs[] = {
    /* Auto. */
    {
        .lightMode = CAMERA_LIGHT_MODE_AUTO,
        .awbCtrl   = 0x00,
        .awbR_H    = 0x04,
        .awbR_L    = 0x00,
        .awbG_H    = 0x04,
        .awbG_L    = 0x00,
        .awbB_H    = 0x04,
        .awbB_L    = 0x00,
    },
    /* Sunny. */
    {
        .lightMode = CAMERA_LIGHT_MODE_SUNNY,
        .awbCtrl   = 0x01,
        .awbR_H    = 0x06,
        .awbR_L    = 0x1c,
        .awbG_H    = 0x04,
        .awbG_L    = 0x00,
        .awbB_H    = 0x04,
        .awbB_L    = 0xf3,
    },
    /* Office. */
    {
        .lightMode = CAMERA_LIGHT_MODE_OFFICE,
        .awbCtrl   = 0x01,
        .awbR_H    = 0x05,
        .awbR_L    = 0x48,
        .awbG_H    = 0x04,
        .awbG_L    = 0x00,
        .awbB_H    = 0x07,
        .awbB_L    = 0xcf,
    },
    /* Cloudy. */
    {
        .lightMode = CAMERA_LIGHT_MODE_CLOUDY,
        .awbCtrl   = 0x01,
        .awbR_H    = 0x06,
        .awbR_L    = 0x48,
        .awbG_H    = 0x04,
        .awbG_L    = 0x00,
        .awbB_H    = 0x04,
        .awbB_L    = 0xd3,
    },
    /* Home. */
    {
        .lightMode = CAMERA_LIGHT_MODE_HOME,
        .awbCtrl   = 0x01,
        .awbR_H    = 0x04,
        .awbR_L    = 0x10,
        .awbG_H    = 0x04,
        .awbG_L    = 0x00,
        .awbB_H    = 0x08,
        .awbB_L    = 0x40,
    },
};

static const ov5640_special_effect_config_t s_ov5640SpecialEffectConfigs[] = {
    /* Normal. */
    {
        .effect   = CAMERA_SPECIAL_EFFECT_NORMAL,
        .sdeCtrl0 = 0x06,
        .sdeCtrl3 = 0x40,
        .sdeCtrl4 = 0x10,
    },
    /* Bluish. */
    {
        .effect   = CAMERA_SPECIAL_EFFECT_BLUISH,
        .sdeCtrl0 = 0x1e,
        .sdeCtrl3 = 0xa0,
        .sdeCtrl4 = 0x40,
    },
    /* Redish. */
    {
        .effect   = CAMERA_SPECIAL_EFFECT_REDISH,
        .sdeCtrl0 = 0x1e,
        .sdeCtrl3 = 0x80,
        .sdeCtrl4 = 0xc0,
    },
    /* B & W */
    {
        .effect   = CAMERA_SPECIAL_EFFECT_BW,
        .sdeCtrl0 = 0x1e,
        .sdeCtrl3 = 0x80,
        .sdeCtrl4 = 0x80,
    },
    /* Sepia. */
    {
        .effect   = CAMERA_SPECIAL_EFFECT_SEPIA,
        .sdeCtrl0 = 0x1e,
        .sdeCtrl3 = 0x40,
        .sdeCtrl4 = 0xa0,
    },
    /* Negtive. */
    {
        .effect   = CAMERA_SPECIAL_EFFECT_NEGTIVE,
        .sdeCtrl0 = 0x40,
        .sdeCtrl3 = 0x40,
        .sdeCtrl4 = 0x10,
    },
    /* Greenish. */
    {
        .effect   = CAMERA_SPECIAL_EFFECT_GREENISH,
        .sdeCtrl0 = 0x1e,
        .sdeCtrl3 = 0x60,
        .sdeCtrl4 = 0x60,
    },
};

static const ov5640_cmd_func_map_t s_ov5640CmdFuncMap[] = {
    {
        kCAMERA_DeviceLightMode,
        OV5640_SetLightMode,
    },
    {
        kCAMERA_DeviceSaturation,
        OV5640_SetSaturation,
    },
    {
        kCAMERA_DeviceBrightness,
        OV5640_SetBrightness,
    },
    {
        kCAMERA_DeviceContrast,
        OV5640_SetContrast,
    },
    {
        kCAMERA_DeviceSpecialEffect,
        OV5640_SetSpecialEffect,
    },
};

const camera_device_operations_t ov5640_ops = {
    .init     = OV5640_Init,
    .deinit   = OV5640_Deinit,
    .start    = OV5640_Start,
    .stop     = OV5640_Stop,
    .control  = OV5640_Control,
    .init_ext = OV5640_InitExt,
};

/*******************************************************************************
 * Code
 ******************************************************************************/

static status_t OV5640_LoadRegVal(camera_device_handle_t *handle, const ov5640_reg_val_t regVal[], uint32_t num)
{
    uint32_t i;
    status_t status;

    for (i = 0; i < num; i++)
    {
        status = OV5640_WriteReg(handle, regVal[i].regAddr, regVal[i].regVal);

        if (kStatus_Success != status)
        {
            return status;
        }
    }

    return kStatus_Success;
}

static status_t OV5640_SoftwareReset(camera_device_handle_t *handle)
{
    ov5640_reg_val_t param[] = {{0x3103, 0x11}, {0x3008, 0x82}};

    return OV5640_LoadRegVal(handle, param, ARRAY_SIZE(param));
}

