vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/components/video/camera/device/ov5640/fsl_ov5640.c
static const uint8_t *OV5640_GetResolutionParam(uint32_t resolution)
{
    /*
     * This function returns the parameter for specific resolution, if
     * the resolution is not supported, returns NULL.
     */
    uint32_t i;

    for (i = 0; i < ARRAY_SIZE(resolutionParam); i++)
    {
        if (resolution == resolutionParam[i].resolution)
        {
            return resolutionParam[i].param;
        }
    }

    return NULL;
}

static const ov5640_clock_config_t *OV5640_GetClockConfig(const camera_config_t *config)
{
    uint32_t i;

    if (kCAMERA_InterfaceMIPI == config->interface)
    {
        for (i = 0; i < ARRAY_SIZE(s_ov5640MipiClockConfigs); i++)
        {
            if ((config->framePerSec == s_ov5640MipiClockConfigs[i].framePerSec) &&
                (config->resolution == s_ov5640MipiClockConfigs[i].resolution))
            {
                return &s_ov5640MipiClockConfigs[i];
            }
        }
    }
    else
    {
        for (i = 0; i < ARRAY_SIZE(s_ov5640DvpClockConfigs); i++)
        {
            if ((config->framePerSec == s_ov5640DvpClockConfigs[i].framePerSec) &&
                (config->resolution == s_ov5640DvpClockConfigs[i].resolution))
            {
                return &s_ov5640DvpClockConfigs[i];
            }
        }
    }

    return NULL;
}

static status_t OV5640_SetPixelFormat(camera_device_handle_t *handle, video_pixel_format_t pixelFormat)
{
    status_t status;
    uint8_t param[2];

    switch (pixelFormat)
    {
        case kVIDEO_PixelFormatYUYV:
            param[0] = 0x3F;
            param[1] = 0x00;
            break;

        case kVIDEO_PixelFormatRGB565:
        default:
            param[0] = 0x6f;
            param[1] = 0x01;
            break;
    }

    OV5640_CHECK_RET(OV5640_WriteReg(handle, 0x4300, param[0]));
    OV5640_CHECK_RET(OV5640_WriteReg(handle, 0x501f, param[1]));

    return kStatus_Success;
}

status_t OV5640_Init(camera_device_handle_t *handle, const camera_config_t *config)
{
    status_t status;
    ov5640_resource_t *resource = (ov5640_resource_t *)(handle->resource);
    uint8_t reg;
    const ov5640_clock_config_t *clockConfig;

    /* Verify the configuration. */
    const uint8_t *resParam = OV5640_GetResolutionParam(config->resolution);

    if (NULL == resParam)
    {
        return kStatus_InvalidArgument;
    }

    if ((kVIDEO_PixelFormatYUYV != config->pixelFormat) && (kVIDEO_PixelFormatRGB565 != config->pixelFormat))
    {
        return kStatus_InvalidArgument;
    }

    if ((kCAMERA_InterfaceNonGatedClock != config->interface) && (kCAMERA_InterfaceGatedClock != config->interface) &&
        (kCAMERA_InterfaceCCIR656 != config->interface) && (kCAMERA_InterfaceMIPI != config->interface))
    {
        return kStatus_InvalidArgument;
    }

    /* Only support 2 data lanes. */
    if ((kCAMERA_InterfaceMIPI == config->interface) && (2U != config->csiLanes))
    {
        return kStatus_InvalidArgument;
    }

    clockConfig = OV5640_GetClockConfig(config);

    if (NULL == clockConfig)
    {
        return kStatus_InvalidArgument;
    }

    resource->pullPowerDownPin(true);
    resource->pullResetPin(false);

    /* Delay 5ms. */
    OV5640_DelayMs(5);

    resource->pullPowerDownPin(false);

    /* Delay 1ms. */
    OV5640_DelayMs(1);

    resource->pullResetPin(true);

    /* Delay 20ms. */
    OV5640_DelayMs(20);

    OV5640_CHECK_RET(OV5640_SoftwareReset(handle));

    /* Delay 5ms. */
    OV5640_DelayMs(5);

    /* Initialize. */
    status = OV5640_LoadRegVal(handle, ov5640InitParam, ARRAY_SIZE(ov5640InitParam));
    if (kStatus_Success != status)
    {
        return status;
    }

    /* Resolution. */
    OV5640_CHECK_RET(OV5640_WriteMultiRegs(handle, 0x3800, resParam, OV5640_RESOLUTION_PARAM_NUM));

    if ((uint32_t)kVIDEO_Resolution1080P == config->resolution)
    {
        OV5640_CHECK_RET(OV5640_WriteReg(handle, 0x3709, 0x12));
        OV5640_CHECK_RET(OV5640_WriteReg(handle, 0x3821, 0x06));
    }

    OV5640_CHECK_RET(OV5640_WriteReg(handle, 0x302c, 0xc2));

    /* Pixel format. */
    OV5640_CHECK_RET(OV5640_SetPixelFormat(handle, config->pixelFormat));

    /* Clock. */
    OV5640_CHECK_RET(OV5640_WriteReg(handle, 0x3035, clockConfig->pllCtrl1));
    OV5640_CHECK_RET(OV5640_WriteReg(handle, 0x3036, clockConfig->pllCtrl2));
    OV5640_CHECK_RET(OV5640_WriteReg(handle, 0x460c, clockConfig->vfifoCtrl0C));
    OV5640_CHECK_RET(OV5640_WriteReg(handle, 0x3824, clockConfig->pclkDiv));
    OV5640_CHECK_RET(OV5640_WriteReg(handle, 0x4837, clockConfig->pclkPeriod));

    /* Interface. */
    if (kCAMERA_InterfaceMIPI == config->interface)
    {
        OV5640_CHECK_RET(OV5640_WriteReg(handle, 0x3034, 0x18));

        /* Set Frex, Vsync, Href, PCLK, data, GPIO to input. */
        OV5640_CHECK_RET(OV5640_WriteReg(handle, 0x3017, 0x00));
        OV5640_CHECK_RET(OV5640_WriteReg(handle, 0x3018, 0x00));

        /*
         * Set to MIPI mode, set data lane. Currently only support 2 data lanes,
         * if need to use 1 data lane, write 0x25 to register 0x300e.
         */
        OV5640_CHECK_RET(OV5640_WriteReg(handle, 0x300e, 0x45));

        /* Virtual channel. */
        OV5640_CHECK_RET(OV5640_ModifyReg(handle, 0x4814, (3U << 6), (uint8_t)(config->mipiChannel) << 6));

        OV5640_CHECK_RET(OV5640_WriteReg(handle, 0x4800, 0x04));
    }
    else
    {
        OV5640_CHECK_RET(OV5640_WriteReg(handle, 0x3034, 0x1a));

        /* Set Frex, Vsync, Href, PCLK, data, GPIO to output. */
        OV5640_CHECK_RET(OV5640_WriteReg(handle, 0x3017, 0xFF));
        OV5640_CHECK_RET(OV5640_WriteReg(handle, 0x3018, 0xFF));

        /* DVP mode */
        OV5640_CHECK_RET(OV5640_WriteReg(handle, 0x300e, 0x58));

        if (kCAMERA_InterfaceCCIR656 == config->interface)
        {
            OV5640_CHECK_RET(OV5640_WriteReg(handle, 0x4719, 0x01));
            OV5640_CHECK_RET(OV5640_WriteReg(handle, 0x4730, 0x01));
        }
    }

