vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/components/video/camera/device/ov5640/fsl_ov5640.c
    /* Signal polarity */
    reg = 0;
    if ((uint32_t)kCAMERA_HrefActiveHigh != (config->controlFlags & (uint32_t)kCAMERA_HrefActiveHigh))
    {
        reg |= OV5640_POLARITY_CTRL00_HREF_MASK;
    }
    if ((uint32_t)kCAMERA_VsyncActiveHigh != (config->controlFlags & (uint32_t)kCAMERA_VsyncActiveHigh))
    {
        reg |= OV5640_POLARITY_CTRL00_VSYNC_MASK;
    }
    if ((uint32_t)kCAMERA_DataLatchOnRisingEdge == (config->controlFlags & (uint32_t)kCAMERA_DataLatchOnRisingEdge))
    {
        reg |= OV5640_POLARITY_CTRL00_PCLK_MASK;
    }

    if (kCAMERA_InterfaceNonGatedClock == config->interface)
    {
        reg |= OV5640_POLARITY_CTRL00_GATE_PCLK_HREF_MASK | OV5640_POLARITY_CTRL00_GATE_PCLK_VSYNC_MASK;
    }

    OV5640_CHECK_RET(OV5640_WriteReg(handle, 0x4740, reg));

    /* Lenc on, raw gamma on, BPC on, WPC on, CIP on. */
    OV5640_CHECK_RET(OV5640_WriteReg(handle, 0x5000, 0xa7));

    OV5640_CHECK_RET(OV5640_WriteReg(handle, 0x3008, 0x02));

    return kStatus_Success;
}

status_t OV5640_Deinit(camera_device_handle_t *handle)
{
    ((ov5640_resource_t *)(handle->resource))->pullPowerDownPin(true);

    return kStatus_Success;
}

status_t OV5640_Control(camera_device_handle_t *handle, camera_device_cmd_t cmd, int32_t arg)
{
    for (uint8_t i = 0; i < ARRAY_SIZE(s_ov5640CmdFuncMap); i++)
    {
        if (s_ov5640CmdFuncMap[i].cmd == cmd)
        {
            return s_ov5640CmdFuncMap[i].func(handle, arg);
        }
    }

    return kStatus_InvalidArgument;
}

status_t OV5640_Start(camera_device_handle_t *handle)
{
    return OV5640_WriteReg(handle, 0x3008, 0x02);
}

status_t OV5640_Stop(camera_device_handle_t *handle)
{
    return OV5640_WriteReg(handle, 0x3008, 0x42);
}

status_t OV5640_InitExt(camera_device_handle_t *handle, const camera_config_t *config, const void *specialConfig)
{
    return OV5640_Init(handle, config);
}

status_t OV5640_SetBrightness(camera_device_handle_t *handle, int32_t brightness)
{
    status_t status;

    if ((brightness < -4) || (brightness > 4))
    {
        return kStatus_InvalidArgument;
    }

    OV5640_CHECK_RET(OV5640_WriteReg(handle, 0x3212, 0x03));
    if (brightness >= 0)
    {
        status = OV5640_WriteReg(handle, OV5640_SDE_CTRL8_REG, 0x01);
    }
    else
    {
        brightness = -brightness;
        status     = OV5640_WriteReg(handle, OV5640_SDE_CTRL8_REG, 0x09);
    }

    if (kStatus_Success != status)
    {
        return status;
    }

    OV5640_CHECK_RET(OV5640_WriteReg(handle, OV5640_SDE_CTRL7_REG, ((uint8_t)brightness) << 4U));

    OV5640_CHECK_RET(OV5640_WriteReg(handle, 0x3212, 0x13));
    return OV5640_WriteReg(handle, 0x3212, 0xa3);
}

status_t OV5640_SetContrast(camera_device_handle_t *handle, int32_t contrast)
{
    status_t status;
    uint8_t regVal;

    if ((-4 > contrast) || (4 < contrast))
    {
        return kStatus_InvalidArgument;
    }

    contrast = 0x20 + contrast * 0x04;
    regVal   = (uint8_t)contrast;

    OV5640_CHECK_RET(OV5640_WriteReg(handle, 0x3212, 0x03));

    OV5640_CHECK_RET(OV5640_WriteReg(handle, OV5640_SDE_CTRL0_REG, 0x04));
    OV5640_CHECK_RET(OV5640_WriteReg(handle, OV5640_SDE_CTRL5_REG, regVal));
    OV5640_CHECK_RET(OV5640_WriteReg(handle, OV5640_SDE_CTRL6_REG, regVal));

    OV5640_CHECK_RET(OV5640_WriteReg(handle, 0x3212, 0x13));
    return OV5640_WriteReg(handle, 0x3212, 0xa3);
}

status_t OV5640_SetSaturation(camera_device_handle_t *handle, int32_t saturation)
{
    status_t status;
    uint8_t regVal;

    if ((-4 > saturation) || (4 < saturation))
    {
        return kStatus_InvalidArgument;
    }

    saturation = 0x40 + saturation * 0x10;
    regVal     = (uint8_t)saturation;

    OV5640_CHECK_RET(OV5640_WriteReg(handle, 0x3212, 0x03));

    OV5640_CHECK_RET(OV5640_WriteReg(handle, OV5640_SDE_CTRL0_REG, 0x02));
    OV5640_CHECK_RET(OV5640_WriteReg(handle, OV5640_SDE_CTRL3_REG, regVal));
    OV5640_CHECK_RET(OV5640_WriteReg(handle, OV5640_SDE_CTRL4_REG, regVal));
    OV5640_CHECK_RET(OV5640_WriteReg(handle, OV5640_SDE_CTRL8_REG, 0x41));

    OV5640_CHECK_RET(OV5640_WriteReg(handle, 0x3212, 0x13));
    return OV5640_WriteReg(handle, 0x3212, 0xa3);
}

status_t OV5640_SetLightMode(camera_device_handle_t *handle, int32_t lightMode)
{
    status_t status;
    uint8_t i;

    for (i = 0; i < ARRAY_SIZE(s_ov5640LightModeConfigs); i++)
    {
        if (lightMode == (int32_t)s_ov5640LightModeConfigs[i].lightMode)
        {
            OV5640_CHECK_RET(OV5640_WriteReg(handle, 0x3212, 0x03));

            OV5640_CHECK_RET(OV5640_WriteReg(handle, OV5640_AWB_CTRL_REG, s_ov5640LightModeConfigs[i].awbCtrl));
            OV5640_CHECK_RET(OV5640_WriteReg(handle, OV5640_AWB_R_H_REG, s_ov5640LightModeConfigs[i].awbR_H));
            OV5640_CHECK_RET(OV5640_WriteReg(handle, OV5640_AWB_R_L_REG, s_ov5640LightModeConfigs[i].awbR_L));
            OV5640_CHECK_RET(OV5640_WriteReg(handle, OV5640_AWB_G_H_REG, s_ov5640LightModeConfigs[i].awbG_H));
            OV5640_CHECK_RET(OV5640_WriteReg(handle, OV5640_AWB_G_L_REG, s_ov5640LightModeConfigs[i].awbG_L));
            OV5640_CHECK_RET(OV5640_WriteReg(handle, OV5640_AWB_B_H_REG, s_ov5640LightModeConfigs[i].awbB_H));
            OV5640_CHECK_RET(OV5640_WriteReg(handle, OV5640_AWB_B_L_REG, s_ov5640LightModeConfigs[i].awbB_L));

            OV5640_CHECK_RET(OV5640_WriteReg(handle, 0x3212, 0x13));
            return OV5640_WriteReg(handle, 0x3212, 0xa3);
        }
    }

    /* No configuration found. */
    return kStatus_InvalidArgument;
}

status_t OV5640_SetSpecialEffect(camera_device_handle_t *handle, int32_t effect)
{
    status_t status;
    uint8_t i;

    for (i = 0; i < ARRAY_SIZE(s_ov5640SpecialEffectConfigs); i++)
    {
        if (effect == (int32_t)s_ov5640SpecialEffectConfigs[i].effect)
        {
            OV5640_CHECK_RET(OV5640_WriteReg(handle, 0x3212, 0x03));

            OV5640_CHECK_RET(OV5640_WriteReg(handle, OV5640_SDE_CTRL0_REG, s_ov5640SpecialEffectConfigs[i].sdeCtrl0));
            OV5640_CHECK_RET(OV5640_WriteReg(handle, OV5640_SDE_CTRL3_REG, s_ov5640SpecialEffectConfigs[i].sdeCtrl3));
            OV5640_CHECK_RET(OV5640_WriteReg(handle, OV5640_SDE_CTRL4_REG, s_ov5640SpecialEffectConfigs[i].sdeCtrl4));

            OV5640_CHECK_RET(OV5640_WriteReg(handle, 0x5003, 0x08));
            OV5640_CHECK_RET(OV5640_WriteReg(handle, 0x3212, 0x13));
            return OV5640_WriteReg(handle, 0x3212, 0xa3);
        }
    }

    /* No configuration found. */
    return kStatus_InvalidArgument;
}
